suzanne_pimple_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          900;
        startFace       873480;
    }
    outlet
    {
        type            patch;
        nFaces          900;
        startFace       874380;
    }
    side
    {
        type            patch;
        nFaces          7200;
        startFace       875280;
    }
    monkey
    {
        type            wall;
        inGroups        1(wall);
        nFaces          22008;
        startFace       882480;
    }
)

// ************************************************************************* //
